videosdk-live/IoTSdk/examples/video_call/sdkconfig.defaults
# Project defaults for this VideoSDK IoT example.
#
# ESP-IDF reads this file ONLY on the first build, when no `sdkconfig` exists yet.
# After that, change settings with `idf.py menuconfig` (which writes `sdkconfig`).
# These values are tuned so the SDK -- which runs audio, video, and the WebRTC
# network stack at the same time on the ESP32-S3 -- has enough memory and CPU.
# Removing them can cause failed connections or resets, so keep them unless you
# know your build does not need a given one.
#
# Pick your board first, under menuconfig -> "SET Microcontroller"
# (ESP32-S3-Korvo-2 or the XIAO ESP32-S3)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16

# Flash: this board has 8 MB, and QIO (4-line) reads run code from flash roughly
# twice as fast as the default 2-line mode. A custom partition table is used to
# fit the app.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_EXAMPLE_CONNECT_IPV6=n
CONFIG_ESP_PHY_REDUCE_TX_POWER=y

# PSRAM (external RAM) -- REQUIRED. The SDK's audio/video buffers and the WiFi
# network buffers live here so the small, fast internal RAM stays free for
# time-critical work. Running PSRAM at 80 MHz roughly doubles its bandwidth,
# which speeds up the whole audio + video + network path.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Keep WiFi/network buffers and task stacks in PSRAM so enough internal RAM stays
# free while a call is active. Without these, the device can fail to connect or
# reset once audio and video are both streaming.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Reserve a slice of fast internal RAM for the WiFi driver and encryption, which
# cannot run from PSRAM. This is what keeps outgoing audio/video packets flowing
# when the network is busy. Do not lower these; raising the reserve does not help
# if you are short on RAM -- reduce what you allocate instead.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384

# Run at full 240 MHz and build size-optimized (-Os). -Os is noticeably faster
# than the debug default for the SDK's audio/video/network code, not just smaller.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# 1 ms scheduler tick: smoother time-sharing between the audio, video, and
# network tasks, which reduces jitter in the call.
CONFIG_FREERTOS_HZ=1000

# Task stacks sized for the SDK's signaling and media work.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048

# WiFi + TCP/IP buffers tuned so the video stream does not starve the network
# stack and drop outgoing packets.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=48
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_DHCP6=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
# Larger inbound UDP queue so received audio/video is not dropped while the
# outgoing stream keeps the network busy.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64

# Logging. A normal build is quiet -- lifecycle messages, warnings, and errors
# only. This line compiles the SDK's debug logs into the image (a few KB of
# flash) WITHOUT turning them on, so you can enable them later at
# menuconfig -> "VideoSDK Logging" -> Debug, or from code with
# videosdk_set_log_mode(VIDEOSDK_LOG_DEBUG). Leave it in, or debug mode prints
# nothing extra.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# TLS / DTLS -- required to reach the VideoSDK signaling server over wss:// and
# for the encrypted WebRTC media transport. The certificate bundle verifies the
# server's certificate.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# Camera (used by the video send path). The common sensors are enabled so the
# driver auto-detects whichever one is fitted on your board.
CONFIG_OV2640_SUPPORT=y
CONFIG_OV3660_SUPPORT=y
CONFIG_OV5640_SUPPORT=y
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=32768
